app/Controllers/Admin.php

    public function index()
    {
        if (!session()->get('user_id') || session()->get('user_role') !== 'admin') {
            return redirect()->to('/');
        }

        $data = [
            'title' => 'Admin Dashboard - Rhys Firearms',
            'total_users' => $this->userModel->countAll(),
            'total_products' => $this->productModel->countAll(),
            'total_orders' => $this->orderModel->countAll(),
            'pending_orders' => $this->orderModel->where('status', 'pending')->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'

    public function products()
    {
        if (!session()->get('user_id') || session()->get('user_role') !== 'admin') {
            return redirect()->to('/');
        }

        $data = [
            'title' => 'Product Management - Rhys Firearms',
            'products' => $this->productModel->getProductsWithDetails(),
            'categories' => $this->categoryModel->findAll(),
            'teams' => $this->teamModel->findAll()
---
SELECT *
FROM `category`
SELECT *
FROM `teams`