app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data = $model->findAll();

INSERT INTO `products` (`name`, `type`, `category_id`, `team_id`, `price`, `description`) VALUES ('bebasan', 'firearms', 1, 1, 200, '')
---
    public function create()
    {
        $model = new ProductModel();
        $data = $this->request->getJSON(true);

        if (!$model->insert($data)) {