app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function index()
    {
        $model = new UserModel();
        $data = $model->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@rhysfirearms.com'
 LIMIT 1
---
    public function login()
    {
        $data = $this->request->getJSON(true);
        $email = $data['email'] ?? null;
        $password = $data['password'] ?? null;
        $model = new UserModel();
        $user = $model->where('email', $email)->first();