app/Models/CategoryModel.php

SELECT *
FROM `category`
ORDER BY `sort_order` ASC
---
    public function getOrdered()
    {
        return $this->orderBy('sort_order', 'ASC')->findAll();