app/Models/OrderModel.php

SELECT `orders`.*, `users`.`username`, `users`.`email`
FROM `orders`
JOIN `users` ON `users`.`id` = `orders`.`user_id`
---
    public function getOrdersWithUser($userId = null)
    {
        $builder = $this->select('orders.*, users.username, users.email')
                       ->join('users', 'users.id = orders.user_id');

        if ($userId) {
            $builder->where('orders.user_id', $userId);
        }

        return $builder->findAll();