app/Models/ProductModel.php

    public function getProductsWithDetails()
    {
        return $this->select('products.*, category.name as category_name, teams.name as team_name')
                    ->join('category', 'category.id = products.category_id')
                    ->join('teams', 'teams.id = products.team_id')
                    ->findAll();
---
SELECT `products`.*, `category`.`name` as `category_name`, `teams`.`name` as `team_name`
FROM `products`
JOIN `category` ON `category`.`id` = `products`.`category_id`
JOIN `teams` ON `teams`.`id` = `products`.`team_id`

    public function getProductWithDetails($id)
    {
        return $this->select('products.*, category.name as category_name, teams.name as team_name')
                    ->join('category', 'category.id = products.category_id')
                    ->join('teams', 'teams.id = products.team_id')
                    ->find($id);
---
SELECT `products`.*, `category`.`name` as `category_name`, `teams`.`name` as `team_name`
FROM `products`
JOIN `category` ON `category`.`id` = `products`.`category_id`
JOIN `teams` ON `teams`.`id` = `products`.`team_id`
WHERE `products`.`id` = '2'