app/Models/TransactionModel.php

    public function getCartItems($userId)
    {
        return $this->select('transaction.*, products.name, products.price, products.description')
                    ->join('products', 'products.id = transaction.product_id')
                    ->where('user_id', $userId)
                    ->where('status', 'cart')
                    ->findAll();
---
SELECT `transaction`.*, `products`.`name`, `products`.`price`, `products`.`description`
FROM `transaction`
JOIN `products` ON `products`.`id` = `transaction`.`product_id`
WHERE `user_id` = '1'
AND `status` = 'cart'